Tekla Open API Reference for Tekla Structures 2025
AnalysisMember Properties
The AnalysisMember type exposes the following members.
Properties
Name | Description
AnalysisDesignCode
 Gets or sets the analysis design code of the member.
AnalysisModelName
 Gets or sets the analysis model name.
 (Inherited from AnalysisObject.)
AnalysisObjectType
 Gets or sets the type of the analysis object.
 (Inherited from AnalysisObject.)
Composite
 Gets or sets the composite settings of the member.
Curvature
 Gets or sets the beam curvature of the member.
End
 Gets or sets the analysis beam end settings at the end of the member.
FatherObject2ID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObject2Type
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
FatherObjectID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObjectType
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
ID
 Gets or sets the identifier of the analysis object.
 (Inherited from AnalysisObject.)
Label
 Gets or sets the label of the analysis member.
Material
 Gets or sets the material of the analysis member.
Start
 Gets or sets the analysis beam end settings at the start of the member.
Top
See Also
Reference
AnalysisMember Class
Tekla.Structures.Analysis Namespace